CSI API ETABS v1

# cFileGetFilePath Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetFilePath(
    	ref string FilePath
    )

    Function GetFilePath (
    	ByRef FilePath As String
    ) As Integer

    Dim instance As cFile
    Dim FilePath As String
    Dim returnValue As Integer

    returnValue = instance.GetFilePath(FilePath)

    int GetFilePath(
    	String^% FilePath
    )

    abstract GetFilePath :
            FilePath : string byref -> int

#### Parameters

FilePath

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cFile Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com